Repository: shyuni4u/nexus-fates
Catalog: lib/l10n/app_*.arb
Languages: es, ja, ko

# appTitle
source: Nexus Fates
es: Nexus Destinos
ja: ネクサス運命
ko: 넥서스 운명

# homeScreenTitle
source: Tarot Reading
es: Lectura de Tarot
ja: タロットリーディング
ko: 타로 리딩

# questionInputTitle
source: Ask Your Question
es: Haz tu Pregunta
ja: 質問を入力してください
ko: 질문을 입력하세요

# questionInputHint
source: What would you like guidance on?
es: ¿Sobre qué te gustaría recibir orientación?
ja: どのような指導を受けたいですか？
ko: 어떤 지침을 받고 싶으신가요?

# questionInputExample1
source: What should I focus on in my career?
es: ¿En qué debería enfocarme en mi carrera?
ja: キャリアで何に集中すべきでしょうか？
ko: 직업에서 무엇에 집중해야 할까요?

# questionInputExample2
source: How can I improve my relationships?
es: ¿Cómo puedo mejorar mis relaciones?
ja: 人間関係をどのように改善できますか？
ko: 인간관계를 어떻게 개선할 수 있을까요?

# questionInputExample3
source: What obstacles should I be aware of?
es: ¿De qué obstáculos debería estar consciente?
ja: どのような障害に注意すべきでしょうか？
ko: 어떤 장애물을 조심해야 할까요?

# cardSelectionTitle
source: Draw Your Cards
es: Saca tus Cartas
ja: カードを引いてください
ko: 카드를 뽑으세요

source: Shuffle Cards
es: Barajar Cartas
ja: カードをシャッフル
ko: 카드 섞기

source: Draw Cards
es: Sacar Cartas
ja: カードを引く
ko: 카드 뽑기

source: Watch Ad to View Reading
es: Ver Anuncio para Ver Lectura
ja: 広告視聴後リーディングを見る
ko: 광고 시청 후 리딩 보기

source: View Reading
es: Ver Lectura
ja: リーディングを見る
ko: 리딩 보기

# readingTitle
source: Your Celtic Cross Reading
es: Tu Lectura de Cruz Celta
ja: ケルト十字リーディング結果
ko: 켈틱 크로스 리딩 결과

source: Save Reading
es: Guardar Lectura
ja: リーディングを保存
ko: 리딩 저장

source: New Reading
es: Nueva Lectura
ja: 新しいリーディング
ko: 새 리딩

# historyTitle
source: Reading History
es: Historial de Lecturas
ja: リーディング履歴
ko: 리딩 기록

# noHistory
source: No readings yet
es: Aún no hay lecturas
ja: まだリーディング履歴がありません
ko: 아직 리딩 기록이 없습니다

source: Loading...
es: Cargando...
ja: 読み込み中...
ko: 로딩 중...

source: Error
ja: エラー
ko: 오류

source: Retry
es: Reintentar
ja: 再試行
ko: 다시 시도

source: Cancel
es: Cancelar
ja: キャンセル
ko: 취소

source: OK
ko: 확인

source: Sign In
es: Iniciar Sesión
ja: サインイン
ko: 로그인

source: Sign Out
es: Cerrar Sesión
ja: サインアウト
ko: 로그아웃

source: Email
es: Correo
ja: メール
ko: 이메일

source: Password
es: Contraseña
ja: パスワード
ko: 비밀번호

source: Settings
es: Configuración
ja: 設定
ko: 설정

source: Language
es: Idioma
ja: 言語
ko: 언어

# celticCrossPosition1
source: Present Situation
es: Situación Presente
ja: 現在の状況
ko: 현재 상황

# celticCrossPosition2
source: Challenge/Cross
es: Desafío/Cruz
ja: チャレンジ/クロス
ko: 도전/교차

# celticCrossPosition3
source: Distant Past/Foundation
es: Pasado Lejano/Fundación
ja: 遠い過去/基盤
ko: 먼 과거/기초

# celticCrossPosition4
source: Recent Past
es: Pasado Reciente
ja: 最近の過去
ko: 최근 과거

# celticCrossPosition5
source: Possible Outcome
es: Resultado Posible
ja: 可能な結果
ko: 가능한 결과

# celticCrossPosition6
source: Immediate Future
es: Futuro Inmediato
ja: 近い未来
ko: 가까운 미래

# celticCrossPosition7
source: Your Approach
es: Tu Enfoque
ja: あなたのアプローチ
ko: 당신의 접근법

# celticCrossPosition8
source: External Influences
es: Influencias Externas
ja: 外部の影響
ko: 외부 영향

# celticCrossPosition9
source: Hopes and Fears
es: Esperanzas y Miedos
ja: 希望と恐れ
ko: 희망과 두려움

# celticCrossPosition10
source: Final Outcome
es: Resultado Final
ja: 最終結果
ko: 최종 결과

source: Reversed
es: Invertida
ja: 逆位置
ko: 역방향

# adLoadingMessage
source: Loading advertisement...
es: Cargando anuncio...
ja: 広告読み込み中...
ko: 광고 로딩 중...

# adNotReady
source: Advertisement not ready, please try again later
es: El anuncio no está listo, intenta de nuevo más tarde
ja: 広告の準備ができていません。しばらくしてから再試行してください。
ko: 광고가 준비되지 않았습니다. 잠시 후 다시 시도해주세요.

# characterCount
source: {count} / {limit} characters
es: {count} / {limit} caracteres
ja: {count} / {limit} 文字
ko: {count} / {limit} 글자

# questionTooLong
source: Question is too long. Please keep it under {limit} characters.
es: La pregunta es muy larga. Manténla bajo {limit} caracteres.
ja: 質問が長すぎます。{limit}文字以内で入力してください。
ko: 질문이 너무 깁니다. {limit}자 이내로 작성해주세요.

# questionRequired
source: Please enter a question before proceeding.
es: Por favor ingresa una pregunta antes de continuar.
ja: 続行する前に質問を入力してください。
ko: 진행하기 전에 질문을 입력해주세요.
